SGLang_Data_20260610_flush_cache/sglang-oai_flush_rr12_il256_ol512.log
benchmark_args=Namespace(backend='sglang-oai', base_url=None, host='127.0.0.1', port=30002, dataset_name='random', dataset_path='', model=None, served_model_name=None, tokenizer=None, num_prompts=200, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=256, random_output_len=512, random_range_ratio=0.0, image_count=1, image_resolution='1080p', image_format='jpeg', image_content='random', request_rate=12.0, use_trace_timestamps=False, max_concurrency=None, output_file='real_pd_sweep_20260610_flush_cache/sglang-oai_flush_rr12_il256_ol512.jsonl', output_details=False, print_requests=False, disable_tqdm=True, disable_stream=False, return_logprob=False, seed=42, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_num_steps=None, profile_by_stage=False, profile_stages=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=True, profile_prefill_url=None, profile_decode_url=None, flush_cache=True, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None)
Namespace(backend='sglang-oai', base_url=None, host='127.0.0.1', port=30002, dataset_name='random', dataset_path='', model='/mnt/nfs02/users/tjiang/Gitrepo/models/Qwen3-8B', served_model_name=None, tokenizer=None, num_prompts=200, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=256, random_output_len=512, random_range_ratio=0.0, image_count=1, image_resolution='1080p', image_format='jpeg', image_content='random', request_rate=12.0, use_trace_timestamps=False, max_concurrency=None, output_file='real_pd_sweep_20260610_flush_cache/sglang-oai_flush_rr12_il256_ol512.jsonl', output_details=False, print_requests=False, disable_tqdm=True, disable_stream=False, return_logprob=False, seed=42, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_num_steps=None, profile_by_stage=False, profile_stages=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=True, profile_prefill_url=None, profile_decode_url=None, flush_cache=True, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None)

#Input tokens: 26096
#Output tokens: 52363
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...

============ Serving Benchmark Result ============
Backend:                                 sglang-oai
Traffic request rate:                    12.0      
Max request concurrency:                 not set   
Successful requests:                     200       
Benchmark duration (s):                  22.60     
Total input tokens:                      26096     
Total input text tokens:                 26096     
Total input vision tokens:               0         
Total generated tokens:                  52363     
Total generated tokens (retokenized):    45309     
Request throughput (req/s):              8.85      
Input token throughput (tok/s):          1154.88   
Output token throughput (tok/s):         2317.32   
Peak output token throughput (tok/s):    3750.00   
Peak concurrent requests:                78        
Total token throughput (tok/s):          3472.20   
Concurrency:                             38.04     
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   4297.98   
Median E2E Latency (ms):                 4030.01   
---------------Time to First Token----------------
Mean TTFT (ms):                          73.94     
Median TTFT (ms):                        73.94     
P99 TTFT (ms):                           109.62    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          16.12     
Median TPOT (ms):                        16.47     
P99 TPOT (ms):                           17.24     
---------------Inter-Token Latency----------------
Mean ITL (ms):                           16.19     
Median ITL (ms):                         16.17     
P95 ITL (ms):                            19.47     
P99 ITL (ms):                            21.85     
Max ITL (ms):                            29.78     
==================================================